Revit 2026 API

# ExternalCommandsData Class

---

Base class used to contain external command information necessary to construct PushButtonData and MenuItem.

SystemObject Autodesk.Revit.UIExternalCommandsData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalCommandsData : IDisposable
```
```vb
Public Class ExternalCommandsData
	Implements IDisposable
```
```cpp
public ref class ExternalCommandsData : IDisposable
```
```fsharp
type ExternalCommandsData =
    class
        interface IDisposable
    end
```

The ExternalCommandsData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyName | The assembly path of the menu item. |
|  | AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this menu item. |
|  | ClassName | The name of the class containing the implementation for the command. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalCommandsData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace